balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/18xxxx/PIC18F67J50.PIC
        <edc:SFRDef edc:access="n--nnnnn" edc:cname="UEIE" edc:desc="" edc:impl="0x9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--00000" edc:name="UEIE" edc:nzwidth="0x8" edc:por="0--00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIDEE" edc:desc="" edc:mask="0x1" edc:name="PIDEE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRC5EE" edc:desc="" edc:mask="0x1" edc:name="CRC5EE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRC16EE" edc:desc="" edc:mask="0x1" edc:name="CRC16EE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DFN8EE" edc:desc="" edc:mask="0x1" edc:name="DFN8EE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTOEE" edc:desc="" edc:mask="0x1" edc:name="BTOEE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="BTSEE" edc:desc="" edc:mask="0x1" edc:name="BTSEE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="UADDR" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="UADDR" edc:nzwidth="0x8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADDR" edc:desc="" edc:mask="0x7f" edc:name="ADDR" edc:nzwidth="0x7"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADDR0" edc:desc="" edc:mask="0x1" edc:name="ADDR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDR1" edc:desc="" edc:mask="0x1" edc:name="ADDR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDR2" edc:desc="" edc:mask="0x1" edc:name="ADDR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDR3" edc:desc="" edc:mask="0x1" edc:name="ADDR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDR4" edc:desc="" edc:mask="0x1" edc:name="ADDR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDR5" edc:desc="" edc:mask="0x1" edc:name="ADDR5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDR6" edc:desc="" edc:mask="0x1" edc:name="ADDR6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="UCFG" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00000" edc:name="UCFG" edc:nzwidth="0x8" edc:por="00-00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PPB" edc:desc="" edc:mask="0x3" edc:name="PPB" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FSEN" edc:desc="" edc:mask="0x1" edc:name="FSEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UTRDIS" edc:desc="" edc:mask="0x1" edc:name="UTRDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPUEN" edc:desc="" edc:mask="0x1" edc:name="UPUEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="UOEMON" edc:desc="" edc:mask="0x1" edc:name="UOEMON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UTEYE" edc:desc="" edc:mask="0x1" edc:name="UTEYE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PPB0" edc:desc="" edc:mask="0x1" edc:name="PPB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PPB1" edc:desc="" edc:mask="0x1" edc:name="PPB1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0xf" edc:beginaddr="0xf60" edc:endaddr="0x1000" edc:regionid="accesssfr">
        <edc:JoinedSFRDef edc:cname="UFRM" edc:desc="" edc:name="UFRM" edc:nzwidth="0x10">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="UFRM" edc:desc="" edc:mask="0x7ff" edc:name="UFRM" edc:nzwidth="0xb"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="UFRML" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="UFRML" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FRM" edc:desc="" edc:mask="0xff" edc:name="FRM" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="FRM0" edc:desc="" edc:mask="0x1" edc:name="FRM0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="FRM1" edc:desc="" edc:mask="0x1" edc:name="FRM1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="FRM2" edc:desc="" edc:mask="0x1" edc:name="FRM2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="FRM3" edc:desc="" edc:mask="0x1" edc:name="FRM3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="FRM4" edc:desc="" edc:mask="0x1" edc:name="FRM4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="FRM5" edc:desc="" edc:mask="0x1" edc:name="FRM5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="FRM6" edc:desc="" edc:mask="0x1" edc:name="FRM6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="FRM7" edc:desc="" edc:mask="0x1" edc:name="FRM7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
